"""โดยนักเรียนแต่ละคนจะใช้เวลาในการ
สอบ 10 นาที  และทุกๆการสอบ 10 คน  ครูจะพัก 30 นาที

ให้รับค่าว่ามีจำนวนนักเรียนกี่คน  
จงคำนวณว่าครูต้องใช้เวลาในการสอบครั้งนี้ทั้งหมดกี่ชม. กี่นาที

Extra:  นักเรียนเลขคู่ ใช้เวลาสอบ 5 นาที  
        นักเรียนเลขคี่ ใช้เวลาสอบ 7 นาที
"""
num = int(input("ป้อนจำนวนนักเรียน: "))

time = 0

for student in range(1, num+1):
    if student % 2 == 0:
        exam_time = 5  #+5 นาที
    else:
        exam_time = 7  #+7 นาที

    time += exam_time


    if student % 10 == 0:
        time += 30

print("เวลาที่ครูใช้ในการสอบทั้งหมด:" ,time, "นาที")